package by.it.markovich.lesson04;

import java.util.Calendar;
import java.util.HashMap;
import java.util.Map;
import java.util.Scanner;

/*
Напишите программу которая спрашивает у пользователя:
Какую вы хотите зарплату в $$$?

После ввода суммы, программа анализирует полученное значение
и если введенная цифра меньше 300 или больше 3000 программа выводит на экран:
Мы вам перезвоним!

Иначе выводит в цикле по переменной int month от 0 до 14 рассчитанную зарплату.
В летние месяцы - выводится введенная сумма с названием месяца.
В несуществующие месяцы 0, 13 и 14 выводится сумма в $0.0
в остальные месяцы выводится указанная сумма с премией в 50%.

Сделайте так, чтобы в тот месяц, когда получилась зарплата в $666 цикл после вывода прерывался.

Пример работы программы (у вас должно быть так же, до символа):

Какую вы хотите зарплату в $$$?
2000
За месяц 0 начислено $0.0
За январь начислено $3000.0
За февраль начислено $3000.0
За март начислено $3000.0
За апрель начислено $3000.0
За май начислено $3000.0
За июнь начислено $2000.0
За июль начислено $2000.0
За август начислено $2000.0
За сентябрь начислено $3000.0
За октябрь начислено $3000.0
За ноябрь начислено $3000.0
За декабрь начислено $3000.0
За месяц 13 начислено $0.0
За месяц 14 начислено $0.0

*/
public class TaskC1 {
    public static void main(String[] args) {
        System.out.println("Какую вы хотите зарплату в $$$?");
        Scanner scanner = new Scanner(System.in);
        int i = scanner.nextInt();

        if (i < 300 || i > 3000) {
            System.out.println("Мы вам перезвоним!");
        } else {
            String[] monthList = {"0", "январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь", "13", "14"};

            for (int month = 0; month <= 14; month++) {
                if (month == 0 || month == 13 || month == 14) {
                    System.out.println("За месяц " + monthList[month] + " начислено $0.0");
                } else if (month == 6 || month == 7 || month == 8) {
                    System.out.println("За " + monthList[month] + " начислено $" + i);
                    if (i == 666) break;
                } else {
                    System.out.println("За " + monthList[month] + " начислено $" + i * 1.5);
                    if (i == 666 / 1.5) break;
                }
            }
        }
    }
}
